SiliconLabsSoftware/sisdk-prerelease/platform_core/platform/service/device_manager/devices/sl_device_peripheral_hal_efr32xg2a.c
/**************************************************************************//**
 * @file
 * @brief Device Manager Peripheral Definition
 ******************************************************************************
 * # License
 * <b>Copyright 2026 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/

#include "em_device.h"
#include "sl_device_peripheral.h"
#include "sl_device_clock.h"
#include <stddef.h>

/***************************************************************************//**
 * @addtogroup device_peripheral Device Abstraction Peripheral
 * @{
 ******************************************************************************/

#if defined(ACMP0_BASE)
// Define peripheral ACMP0.
const sl_peripheral_val_t sl_peripheral_val_acmp0 = { .base = ACMP0_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_ACMP0,
                                                      .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, ACMPROUTE[0].ROUTEEN),
                                                      .gpio_routeen_mask = _GPIO_ACMP_ROUTEEN_MASK };
#endif

#if defined(ACMP1_BASE)
// Define peripheral ACMP1.
const sl_peripheral_val_t sl_peripheral_val_acmp1 = { .base = ACMP1_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_ACMP1,
                                                      .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, ACMPROUTE[1].ROUTEEN),
                                                      .gpio_routeen_mask = _GPIO_ACMP_ROUTEEN_MASK };
#endif

#if defined(BUFC_BASE)
// Define peripheral BUFC.
const sl_peripheral_val_t sl_peripheral_val_bufc = { .base = BUFC_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                     .bus_clock = SL_BUS_CLOCK_BUFC };
#endif

#if defined(BURAM_BASE)
// Define peripheral BURAM.
const sl_peripheral_val_t sl_peripheral_val_buram = { .base = BURAM_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_BURAM };
#endif

#if defined(BURTC_BASE)
// Define peripheral BURTC.
const sl_peripheral_val_t sl_peripheral_val_burtc = { .base = BURTC_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_EM4GRPACLK,
                                                      .bus_clock = SL_BUS_CLOCK_BURTC };
#endif

#if defined(CMU_BASE)
// Define peripheral CMU.
const sl_peripheral_val_t sl_peripheral_val_cmu = { .base = CMU_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                    .bus_clock = SL_BUS_CLOCK_INVALID,
                                                    .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, CMUROUTE.ROUTEEN),
                                                    .gpio_routeen_mask = _GPIO_CMU_ROUTEEN_MASK };
#endif

#if defined(DCDC_BASE)
// Define peripheral DCDC.
const sl_peripheral_val_t sl_peripheral_val_dcdc = { .base = DCDC_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                     .bus_clock = SL_BUS_CLOCK_DCDC };
#endif

#if defined(DMEM_BASE)
// Define peripheral DMEM.
const sl_peripheral_val_t sl_peripheral_val_dmem = { .base = DMEM_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                     .bus_clock = SL_BUS_CLOCK_DMEM };
#endif

#if defined(DPLL0_BASE)
// Define peripheral DPLL0.
const sl_peripheral_val_t sl_peripheral_val_dpll0 = { .base = DPLL0_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_DPLL0 };
#endif

#if defined(EMU_BASE)
// Define peripheral EMU.
const sl_peripheral_val_t sl_peripheral_val_emu = { .base = EMU_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                    .bus_clock = SL_BUS_CLOCK_INVALID };
#endif

#if defined(ETAMPDET_BASE)
// Define peripheral ETAMPDET.
const sl_peripheral_val_t sl_peripheral_val_etampdet = { .base = ETAMPDET_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_EM4GRPACLK,
                                                         .bus_clock = SL_BUS_CLOCK_ETAMPDET };
#endif

#if defined(EUSART0_BASE)
// Define peripheral EUSART0.
const sl_peripheral_eusart_val_t sl_peripheral_val_eusart0 = { .base = EUSART0_BASE,
                                                               .clk_branch = SL_CLOCK_BRANCH_EUSART0CLK,
                                                               .bus_clock = SL_BUS_CLOCK_EUSART0,
                                                               .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, EUSARTROUTE[0].ROUTEEN),
                                                               .gpio_routeen_mask = _GPIO_EUSART_ROUTEEN_MASK,
                                                               .ip_type = SL_PERIPHERAL_SERIAL_TYPE_EUSART,
                                                               .rx_irqn = EUSART0_RX_IRQn,
                                                               .tx_irqn = EUSART0_TX_IRQn,
                                                               .dma_signal_rx_trigger = SL_DMA_SIGNAL_EUSART0_RXFL,
                                                               .dma_signal_tx_trigger = SL_DMA_SIGNAL_EUSART0_TXFL };
#endif

#if defined(EUSART1_BASE)
// Define peripheral EUSART1.
const sl_peripheral_eusart_val_t sl_peripheral_val_eusart1 = { .base = EUSART1_BASE,
                                                               .clk_branch = SL_CLOCK_BRANCH_EM01GRPCCLK,
                                                               .bus_clock = SL_BUS_CLOCK_EUSART1,
                                                               .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, EUSARTROUTE[1].ROUTEEN),
                                                               .gpio_routeen_mask = _GPIO_EUSART_ROUTEEN_MASK,
                                                               .ip_type = SL_PERIPHERAL_SERIAL_TYPE_EUSART,
                                                               .rx_irqn = EUSART1_RX_IRQn,
                                                               .tx_irqn = EUSART1_TX_IRQn,
                                                               .dma_signal_rx_trigger = SL_DMA_SIGNAL_EUSART1_RXFL,
                                                               .dma_signal_tx_trigger = SL_DMA_SIGNAL_EUSART1_TXFL };
#endif

