SiliconLabsSoftware/sisdk-prerelease/platform_core/platform/service/device_manager/devices/sl_device_peripheral_hal_efr32xg2a.c
#if defined(EUSART2_BASE)
// Define peripheral EUSART2.
const sl_peripheral_eusart_val_t sl_peripheral_val_eusart2 = { .base = EUSART2_BASE,
                                                               .clk_branch = SL_CLOCK_BRANCH_EM01GRPCCLK,
                                                               .bus_clock = SL_BUS_CLOCK_EUSART2,
                                                               .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, EUSARTROUTE[2].ROUTEEN),
                                                               .gpio_routeen_mask = _GPIO_EUSART_ROUTEEN_MASK,
                                                               .ip_type = SL_PERIPHERAL_SERIAL_TYPE_EUSART,
                                                               .rx_irqn = EUSART2_RX_IRQn,
                                                               .tx_irqn = EUSART2_TX_IRQn,
                                                               .dma_signal_rx_trigger = SL_DMA_SIGNAL_EUSART2_RXFL,
                                                               .dma_signal_tx_trigger = SL_DMA_SIGNAL_EUSART2_TXFL };
#endif

#if defined(EUSART3_BASE)
// Define peripheral EUSART3.
const sl_peripheral_eusart_val_t sl_peripheral_val_eusart3 = { .base = EUSART3_BASE,
                                                               .clk_branch = SL_CLOCK_BRANCH_EM01GRPCCLK,
                                                               .bus_clock = SL_BUS_CLOCK_EUSART3,
                                                               .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, EUSARTROUTE[3].ROUTEEN),
                                                               .gpio_routeen_mask = _GPIO_EUSART_ROUTEEN_MASK,
                                                               .ip_type = SL_PERIPHERAL_SERIAL_TYPE_EUSART,
                                                               .rx_irqn = EUSART3_RX_IRQn,
                                                               .tx_irqn = EUSART3_TX_IRQn,
                                                               .dma_signal_rx_trigger = SL_DMA_SIGNAL_EUSART3_RXFL,
                                                               .dma_signal_tx_trigger = SL_DMA_SIGNAL_EUSART3_TXFL };
#endif

#if defined(EUSART4_BASE)
// Define peripheral EUSART4.
const sl_peripheral_eusart_val_t sl_peripheral_val_eusart4 = { .base = EUSART4_BASE,
                                                               .clk_branch = SL_CLOCK_BRANCH_EM01GRPCCLK,
                                                               .bus_clock = SL_BUS_CLOCK_EUSART4,
                                                               .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, EUSARTROUTE[4].ROUTEEN),
                                                               .gpio_routeen_mask = _GPIO_EUSART_ROUTEEN_MASK,
                                                               .ip_type = SL_PERIPHERAL_SERIAL_TYPE_EUSART,
                                                               .rx_irqn = EUSART4_RX_IRQn,
                                                               .tx_irqn = EUSART4_TX_IRQn,
                                                               .dma_signal_rx_trigger = SL_DMA_SIGNAL_EUSART4_RXFL,
                                                               .dma_signal_tx_trigger = SL_DMA_SIGNAL_EUSART4_TXFL };
#endif

#if defined(FSRCO_BASE)
// Define peripheral FSRCO.
const sl_peripheral_val_t sl_peripheral_val_fsrco = { .base = FSRCO_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_FSRCO };
#endif

#if defined(GPCRC_BASE)
// Define peripheral GPCRC0.
const sl_peripheral_val_t sl_peripheral_val_gpcrc0 = { .base = GPCRC_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                       .bus_clock = SL_BUS_CLOCK_GPCRC0 };
#endif

#if defined(GPIO_BASE)
// Define peripheral GPIO.
const sl_peripheral_val_t sl_peripheral_val_gpio = { .base = GPIO_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                     .bus_clock = SL_BUS_CLOCK_GPIO };
#endif

#if defined(HFRCO0_BASE)
// Define peripheral HFRCO0.
const sl_peripheral_val_t sl_peripheral_val_hfrco0 = { .base = HFRCO0_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                       .bus_clock = SL_BUS_CLOCK_HFRCO0 };
#endif

#if defined(HFRCOEM23_BASE)
// Define peripheral HFRCOEM23.
const sl_peripheral_val_t sl_peripheral_val_hfrcoem23 = { .base = HFRCOEM23_BASE,
                                                          .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                          .bus_clock = SL_BUS_CLOCK_HFRCOEM23 };
#endif

#if defined(HFXO0_BASE)
// Define peripheral HFXO0.
const sl_peripheral_val_t sl_peripheral_val_hfxo0 = { .base = HFXO0_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_HFXO0 };
#endif

#if defined(HOSTMAILBOX_BASE)
// Define peripheral HOSTMAILBOX.
const sl_peripheral_val_t sl_peripheral_val_hostmailbox = { .base = HOSTMAILBOX_BASE,
                                                            .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                            .bus_clock = SL_BUS_CLOCK_HOSTMAILBOX };
#endif

#if defined(I2C0_BASE)
// Define peripheral I2C0.
const sl_peripheral_i2c_val_t sl_peripheral_val_i2c0 = { .base = I2C0_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_LSPCLK,
                                                         .bus_clock = SL_BUS_CLOCK_I2C0,
                                                         .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, I2CROUTE[0].ROUTEEN),
                                                         .gpio_routeen_mask = _GPIO_I2C_ROUTEEN_MASK,
                                                         .dma_signal_rxdatav = SL_DMA_SIGNAL_I2C0_RXDATAV,
                                                         .dma_signal_txbl = SL_DMA_SIGNAL_I2C0_TXBL };
#endif

