SiliconLabsSoftware/sisdk-prerelease/platform_core/platform/service/device_manager/devices/sl_device_peripheral_hal_efr32xg2a.c
#if defined(I2C1_BASE)
// Define peripheral I2C1.
const sl_peripheral_i2c_val_t sl_peripheral_val_i2c1 = { .base = I2C1_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                         .bus_clock = SL_BUS_CLOCK_I2C1,
                                                         .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, I2CROUTE[1].ROUTEEN),
                                                         .gpio_routeen_mask = _GPIO_I2C_ROUTEEN_MASK,
                                                         .dma_signal_rxdatav = SL_DMA_SIGNAL_I2C1_RXDATAV,
                                                         .dma_signal_txbl = SL_DMA_SIGNAL_I2C1_TXBL };
#endif

#if defined(IADC0_BASE)
// Define peripheral IADC0.
const sl_peripheral_iadc_val_t sl_peripheral_val_iadc0 = { .base = IADC0_BASE,
                                                           .clk_branch = SL_CLOCK_BRANCH_IADCCLK,
                                                           .bus_clock = SL_BUS_CLOCK_IADC0,
                                                           .gpio_routeen_offset = 0xFFFF,
                                                           .gpio_routeen_mask = 0,
                                                           .dma_signal_scan = SL_DMA_SIGNAL_IADC0_SCAN,
                                                           .dma_signal_single = SL_DMA_SIGNAL_IADC0_SINGLE };
#endif

#if defined(ICACHE0_BASE)
// Define peripheral ICACHE0.
const sl_peripheral_val_t sl_peripheral_val_icache0 = { .base = ICACHE0_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                        .bus_clock = SL_BUS_CLOCK_ICACHE0 };
#endif

#if defined(LDMAXBAR_BASE)
// Define peripheral LDMAXBAR0.
const sl_peripheral_ldmaxbar_val_t sl_peripheral_val_ldmaxbar0 = { .base = LDMAXBAR_BASE,
                                                                   .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                                   .bus_clock = SL_BUS_CLOCK_LDMAXBAR0,
                                                                   .gpio_routeen_offset = 0xFFFF,
                                                                   .gpio_routeen_mask = 0,
                                                                   .dma_signal_prsreq0 = SL_DMA_SIGNAL_LDMAXBAR0_PRSREQ0,
                                                                   .dma_signal_prsreq1 = SL_DMA_SIGNAL_LDMAXBAR0_PRSREQ1 };
#endif

#if defined(LESENSE_BASE)
// Define peripheral LESENSE.
const sl_peripheral_lesense_val_t sl_peripheral_val_lesense = { .base = LESENSE_BASE,
                                                                .clk_branch = SL_CLOCK_BRANCH_LESENSEHFCLK,
                                                                .bus_clock = SL_BUS_CLOCK_LESENSE,
                                                                .gpio_routeen_offset = 0xFFFF,
                                                                .gpio_routeen_mask = 0,
                                                                .dma_signal_fifo = SL_DMA_SIGNAL_LESENSE_FIFO };
#endif

#if defined(LETIMER0_BASE)
// Define peripheral LETIMER0.
const sl_peripheral_val_t sl_peripheral_val_letimer0 = { .base = LETIMER0_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_EM23GRPACLK,
                                                         .bus_clock = SL_BUS_CLOCK_LETIMER0,
                                                         .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, LETIMERROUTE.ROUTEEN),
                                                         .gpio_routeen_mask = _GPIO_LETIMER_ROUTEEN_MASK };
#endif

#if defined(LFRCO_BASE)
// Define peripheral LFRCO.
const sl_peripheral_val_t sl_peripheral_val_lfrco = { .base = LFRCO_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_LFRCO };
#endif

#if defined(LFXO_BASE)
// Define peripheral LFXO.
const sl_peripheral_val_t sl_peripheral_val_lfxo = { .base = LFXO_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                     .bus_clock = SL_BUS_CLOCK_LFXO };
#endif

#if defined(MSC_BASE)
// Define peripheral MSC.
const sl_peripheral_msc_val_t sl_peripheral_val_msc = { .base = MSC_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                        .bus_clock = SL_BUS_CLOCK_MSC,
                                                        .gpio_routeen_offset = 0xFFFF,
                                                        .gpio_routeen_mask = 0,
                                                        .dma_signal_wdata = SL_DMA_SIGNAL_MSC_WDATA };
#endif

#if defined(PCNT0_BASE)
// Define peripheral PCNT0.
const sl_peripheral_val_t sl_peripheral_val_pcnt0 = { .base = PCNT0_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_PCNT0CLK,
                                                      .bus_clock = SL_BUS_CLOCK_PCNT0 };
#endif

#if defined(PFMXPPRF_BASE)
// Define peripheral PFMXPPRF.
const sl_peripheral_val_t sl_peripheral_val_pfmxpprf = { .base = PFMXPPRF_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                         .bus_clock = SL_BUS_CLOCK_INVALID };
#endif

#if defined(PRS_BASE)
// Define peripheral PRS.
const sl_peripheral_val_t sl_peripheral_val_prs = { .base = PRS_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                    .bus_clock = SL_BUS_CLOCK_PRS,
                                                    .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, PRSROUTE[0].ROUTEEN),
                                                    .gpio_routeen_mask = _GPIO_PRS_ROUTEEN_MASK };
#endif

