SiliconLabsSoftware/sisdk-prerelease/platform_core/platform/service/device_manager/devices/sl_device_peripheral_hal_efr32xg2a.c
#if defined(RADIOAES_BASE)
// Define peripheral RADIOAES.
const sl_peripheral_val_t sl_peripheral_val_radioaes = { .base = RADIOAES_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                         .bus_clock = SL_BUS_CLOCK_RADIOAES };
#endif

#if defined(RFFPLL0_BASE)
// Define peripheral RFFPLL0.
const sl_peripheral_val_t sl_peripheral_val_rffpll0 = { .base = RFFPLL0_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                        .bus_clock = SL_BUS_CLOCK_RFFPLL0 };
#endif

#if defined(SCRATCHPAD_BASE)
// Define peripheral SCRATCHPAD.
const sl_peripheral_val_t sl_peripheral_val_scratchpad = { .base = SCRATCHPAD_BASE,
                                                           .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                           .bus_clock = SL_BUS_CLOCK_INVALID };
#endif

#if defined(SEMAILBOX_HOST_BASE)
// Define peripheral SEMAILBOX.
const sl_peripheral_val_t sl_peripheral_val_semailbox = { .base = SEMAILBOX_HOST_BASE,
                                                          .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                          .bus_clock = SL_BUS_CLOCK_SEMAILBOX };
#endif

#if defined(SMU_BASE)
// Define peripheral SMU.
const sl_peripheral_val_t sl_peripheral_val_smu = { .base = SMU_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                    .bus_clock = SL_BUS_CLOCK_SMU };
#endif

#if defined(SYSCFG_BASE)
// Define peripheral SYSCFG.
const sl_peripheral_val_t sl_peripheral_val_syscfg = { .base = SYSCFG_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                       .bus_clock = SL_BUS_CLOCK_SYSCFG };
#endif

#if defined(SYSRTC0_BASE)
// Define peripheral SYSRTC0.
const sl_peripheral_val_t sl_peripheral_val_sysrtc0 = { .base = SYSRTC0_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_SYSRTCCLK,
                                                        .bus_clock = SL_BUS_CLOCK_SYSRTC0 };
#endif

#if defined(TIMER0_BASE)
// Define peripheral TIMER0.
const sl_peripheral_timer_val_t sl_peripheral_val_timer0 = { .base = TIMER0_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER0,
                                                             .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, TIMERROUTE[0].ROUTEEN),
                                                             .gpio_routeen_mask = _GPIO_TIMER_ROUTEEN_MASK,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER0_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER0_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER0_CC2,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER0_UFOF };
#endif

#if defined(TIMER1_BASE)
// Define peripheral TIMER1.
const sl_peripheral_timer_val_t sl_peripheral_val_timer1 = { .base = TIMER1_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER1,
                                                             .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, TIMERROUTE[1].ROUTEEN),
                                                             .gpio_routeen_mask = _GPIO_TIMER_ROUTEEN_MASK,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER1_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER1_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER1_CC2,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER1_UFOF };
#endif

#if defined(TIMER2_BASE)
// Define peripheral TIMER2.
const sl_peripheral_timer_val_t sl_peripheral_val_timer2 = { .base = TIMER2_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER2,
                                                             .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, TIMERROUTE[2].ROUTEEN),
                                                             .gpio_routeen_mask = _GPIO_TIMER_ROUTEEN_MASK,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER2_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER2_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER2_CC2,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER2_UFOF };
#endif

#if defined(TIMER3_BASE)
// Define peripheral TIMER3.
const sl_peripheral_timer_val_t sl_peripheral_val_timer3 = { .base = TIMER3_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER3,
                                                             .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, TIMERROUTE[3].ROUTEEN),
                                                             .gpio_routeen_mask = _GPIO_TIMER_ROUTEEN_MASK,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER3_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER3_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER3_CC2,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER3_UFOF };
#endif

#if defined(TIMER4_BASE)
// Define peripheral TIMER4.
const sl_peripheral_timer_val_t sl_peripheral_val_timer4 = { .base = TIMER4_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER4,
                                                             .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, TIMERROUTE[4].ROUTEEN),
                                                             .gpio_routeen_mask = _GPIO_TIMER_ROUTEEN_MASK,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER4_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER4_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER4_CC2,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER4_UFOF };
#endif

#if defined(TIMER5_BASE)
// Define peripheral TIMER5.
const sl_peripheral_timer_val_t sl_peripheral_val_timer5 = { .base = TIMER5_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER5,
                                                             .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, TIMERROUTE[5].ROUTEEN),
                                                             .gpio_routeen_mask = _GPIO_TIMER_ROUTEEN_MASK,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER5_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER5_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER5_CC2,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER5_UFOF };
#endif

#if defined(TIMER6_BASE)
// Define peripheral TIMER6.
const sl_peripheral_timer_val_t sl_peripheral_val_timer6 = { .base = TIMER6_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER6,
                                                             .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, TIMERROUTE[6].ROUTEEN),
                                                             .gpio_routeen_mask = _GPIO_TIMER_ROUTEEN_MASK,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER6_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER6_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER6_CC2,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER6_UFOF };
#endif

#if defined(TIMER7_BASE)
// Define peripheral TIMER7.
const sl_peripheral_timer_val_t sl_peripheral_val_timer7 = { .base = TIMER7_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER7,
                                                             .gpio_routeen_offset = (uint16_t)offsetof(GPIO_TypeDef, TIMERROUTE[7].ROUTEEN),
                                                             .gpio_routeen_mask = _GPIO_TIMER_ROUTEEN_MASK,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER7_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER7_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER7_CC2,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER7_UFOF };
#endif

#if defined(ULFRCO_BASE)
// Define peripheral ULFRCO.
const sl_peripheral_val_t sl_peripheral_val_ulfrco = { .base = ULFRCO_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                       .bus_clock = SL_BUS_CLOCK_ULFRCO };
#endif

#if defined(USB_APBS_BASE)
// Define peripheral USB.
const sl_peripheral_val_t sl_peripheral_val_usb = { .base = USB_APBS_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                    .bus_clock = SL_BUS_CLOCK_USB };
#endif

#if defined(USBAHB_AHBS_BASE)
// Define peripheral USBAHB.
const sl_peripheral_val_t sl_peripheral_val_usbahb = { .base = USBAHB_AHBS_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                       .bus_clock = SL_BUS_CLOCK_INVALID };
#endif

#if defined(USBPLL0_BASE)
// Define peripheral USBPLL0.
const sl_peripheral_val_t sl_peripheral_val_usbpll0 = { .base = USBPLL0_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                        .bus_clock = SL_BUS_CLOCK_INVALID };
#endif

